extension/test/unit/fixtures/ctp-payment.json

{
  "amountPlanned": {
    "type": "centPrecision",
    "currencyCode": "EUR",
    "centAmount": 795,
    "fractionDigits": 2
  },
  "paymentMethodInfo": {
    "paymentInterface": "ctp-adyen-integration"
  },
  "custom": {
    "type": {
      "typeId": "type",
      "key": "ctp-adyen-integration-web-components-payment-type"
    },
    "fields": {}
  },
  "transactions": [
    {
      "id": "6b1d4c68-8e31-4528-9af8-dc09ad653d91",
      "type": "Authorization",
      "amount": {
        "type": "centPrecision",
        "currencyCode": "EUR",
        "centAmount": 495,
        "fractionDigits": 2
      },
      "interactionId": "8835513921644842",
      "state": "Success"
    }
  ],
  "interfaceInteractions": [
    {
      "type": {
        "typeId": "type",
        "key": "ctp-adyen-integration-interaction-payment-type"
      },
      "fields": {
        "request": "{\\\"method\\\":\\\"POST\\\",\\\"body\\\":\\\"{\\\\\\\"amount\\\\\\\":{\\\\\\\"currency\\\\\\\":\\\\\\\"EUR\\\\\\\",\\\\\\\"value\\\\\\\":1000},\\\\\\\"reference\\\\\\\":1673539977614,\\\\\\\"returnUrl\\\\\\\":\\\\\\\"https://ctp-adyen-integration-tests.loca.lt/return-url\\\\\\\",\\\\\\\"merchantAccount\\\\\\\":\\\\\\\"CommercetoolsGmbHDE775\\\\\\\"}\\\",\\\"headers\\\":{\\\"Content-Type\\\":\\\"application/json\\\",\\\"X-Api-Key\\\":\\\"***\\\"}}",
        "createdAt": "2019-02-28T22:16:04.246Z",
        "response": "response",
        "type": "createSession"
      }
    }
  ]
}
